app/Http/Controllers/BlogController.php

    public function index()
    {
//        $blogs = DB::select('SELECT * FROM blogs');

        $blogs = Blog::with('blogaccesses')->get();
---
select * from `blog_accesses` where `blog_accesses`.`blog_id` in (221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 242, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267)
select * from `blogs`